
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.id: Refreshing state... [id=ZP7UUg]
module.dalle-bot.data.google_iam_policy.noauth: Reading...
google_project.project: Refreshing state... [id=projects/discord-bots64fed452]
module.dalle-bot.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account_iam_binding.run-service-agent: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com/roles/run.serviceAgent]
google_project_iam_member.joshua_thompsonja_roles["roles/viewer"]: Refreshing state... [id=discord-bots64fed452/roles/viewer/user:joshua@thompsonja.com]
google_secret_manager_secret.github-key: Refreshing state... [id=projects/discord-bots64fed452/secrets/github-private-repo-key]
google_service_account_iam_binding.admin-account-iam: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com/roles/iam.serviceAccountUser]
google_monitoring_notification_channel.email-owner: Refreshing state... [id=projects/discord-bots64fed452/notificationChannels/1513593783312082253]
google_project_iam_member.joshua_thompsonja_roles["roles/artifactregistry.writer"]: Refreshing state... [id=discord-bots64fed452/roles/artifactregistry.writer/user:joshua@thompsonja.com]
google_project_iam_member.gcp_sa_roles["roles/cloudbuild.serviceAgent"]: Refreshing state... [id=discord-bots64fed452/roles/cloudbuild.serviceAgent/serviceAccount:service-941092486297@gcp-sa-cloudbuild.iam.gserviceaccount.com]
google_project_iam_member.cloudbuild_roles["roles/cloudbuild.builds.builder"]: Refreshing state... [id=discord-bots64fed452/roles/cloudbuild.builds.builder/serviceAccount:941092486297@cloudbuild.gserviceaccount.com]
google_project_iam_member.serverless_robot_prod_roles["roles/artifactregistry.reader"]: Refreshing state... [id=discord-bots64fed452/roles/artifactregistry.reader/serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com]
google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Refreshing state... [id=discord-bots64fed452/roles/run.admin/serviceAccount:941092486297@cloudbuild.gserviceaccount.com]
google_project_iam_member.serverless_robot_prod_roles["roles/run.serviceAgent"]: Refreshing state... [id=discord-bots64fed452/roles/run.serviceAgent/serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com]
google_project_iam_member.compute_roles["roles/run.admin"]: Refreshing state... [id=discord-bots64fed452/roles/run.admin/serviceAccount:941092486297-compute@developer.gserviceaccount.com]
google_storage_bucket.cloud-build-bucket: Refreshing state... [id=discord-bots64fed452_cloudbuild]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudresourcemanager.googleapis.com]
google_project_service.service["firestore.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firestore.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/run.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/iam.googleapis.com]
google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/artifactregistry.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/containerregistry.googleapis.com]
google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/secretmanager.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/serviceusage.googleapis.com]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbilling.googleapis.com]
google_project_service.service["firebase.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firebase.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbuild.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/compute.googleapis.com]
google_secret_manager_secret_iam_binding.github-access: Refreshing state... [id=projects/discord-bots64fed452/secrets/github-private-repo-key/roles/secretmanager.secretAccessor]
time_sleep.artifact_registry_api_enabling: Refreshing state... [id=2023-04-01T19:52:56Z]
google_artifact_registry_repository.artifact-repo: Refreshing state... [id=projects/discord-bots64fed452/locations/us-east1/repositories/services]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dalle-bot.google_cloud_run_service.service will be created
  + resource "google_cloud_run_service" "service" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "dalle"
      + project                    = "discord-bots64fed452"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                  + "autoscaling.knative.dev/minScale" = "0"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + args    = [
                      + "--project_id=discord-bots64fed452",
                    ]
                  + command = [
                      + "/server",
                    ]
                  + image   = "us-docker.pkg.dev/cloudrun/container/hello:latest"
                  + name    = (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.dalle-bot.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-east1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "discord-bots64fed452"
      + service     = "dalle"
    }

  # module.dalle-bot.google_cloudbuild_trigger.service-trigger will be created
  + resource "google_cloudbuild_trigger" "service-trigger" {
      + create_time        = (known after apply)
      + filename           = "cloudbuild.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "dalle/**",
        ]
      + location           = "global"
      + name               = "dalle-trigger"
      + project            = "discord-bots64fed452"
      + substitutions      = {
          + "_APP"  = "dalle"
          + "_ZONE" = "us-east1"
        }
      + trigger_id         = (known after apply)

      + github {
          + name  = "discordbots"
          + owner = "thompsonja"

          + push {
              + branch = "main"
            }
        }
    }

  # module.dalle-bot.google_logging_metric.error_logging_metric will be created
  + resource "google_logging_metric" "error_logging_metric" {
      + description = "Logged errors for dalle bot"
      + filter      = "severity >= ERROR AND logName=\"projects/discord-bots64fed452/logs/dalle-logs\""
      + id          = (known after apply)
      + name        = "dalle_errors"
      + project     = "discord-bots64fed452"

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # module.dalle-bot.google_monitoring_alert_policy.error_logging_alert_policy will be created
  + resource "google_monitoring_alert_policy" "error_logging_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "dalle Error Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/discord-bots64fed452/notificationChannels/1513593783312082253",
        ]
      + project               = "discord-bots64fed452"

      + alert_strategy {
          + auto_close = "3600s"
        }

      + conditions {
          + display_name = "Error logs"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"logging.googleapis.com/user/dalle_errors\" AND resource.type=\"cloud_run_revision\""
              + threshold_value = 0.5

              + aggregations {
                  + alignment_period   = "600s"
                  + per_series_aligner = "ALIGN_SUM"
                }
            }
        }
    }

  # module.dalle-bot.google_project_iam_member.bot-role["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "bot-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "discord-bots64fed452"
      + role    = "roles/logging.logWriter"
    }

  # module.dalle-bot.google_secret_manager_secret.bot-key will be created
  + resource "google_secret_manager_secret" "bot-key" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "discord-bots64fed452"
      + secret_id   = "dalle-key"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"
                }
            }
        }
    }

  # module.dalle-bot.google_secret_manager_secret.bot-secrets["openai-api-secret"] will be created
  + resource "google_secret_manager_secret" "bot-secrets" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "discord-bots64fed452"
      + secret_id   = "openai-api-secret"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"
                }
            }
        }
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-access["bot-key"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "dalle-key"
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-access["openai-api-secret"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "openai-api-secret"
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-viewer["bot-key"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-viewer" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.viewer"
      + secret_id = "dalle-key"
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-viewer["openai-api-secret"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-viewer" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.viewer"
      + secret_id = "openai-api-secret"
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-writer["bot-key"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-writer" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "user:joshua@thompsonja.com",
        ]
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.secretVersionManager"
      + secret_id = "dalle-key"
    }

  # module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-writer["openai-api-secret"] will be created
  + resource "google_secret_manager_secret_iam_binding" "bot-secrets-writer" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "user:joshua@thompsonja.com",
        ]
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.secretVersionManager"
      + secret_id = "openai-api-secret"
    }

  # module.dalle-bot.google_service_account.bot-service-account will be created
  + resource "google_service_account" "bot-service-account" {
      + account_id   = "dalle-sa"
      + disabled     = false
      + display_name = "Service Account for dalle discord bot"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "discord-bots64fed452"
      + unique_id    = (known after apply)
    }

  # module.dalle-bot.google_service_account_iam_binding.bot-iam-binding will be created
  + resource "google_service_account_iam_binding" "bot-iam-binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:941092486297@cloudbuild.gserviceaccount.com",
          + "user:joshua@thompsonja.com",
        ]
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>